doc/BUILD/source/_static/soap_outputs/6.5.314.4301/create_group_from_json_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <group>
          <not_flag>0</not_flag>
          <name>All Computers API TEST</name>
          <type>0</type>
          <and_flag>1</and_flag>
          <deleted_flag>0</deleted_flag>
          <filters></filters>
          <sub_groups>
            <group>
              <id>0</id>
            </group>
          </sub_groups>
        </group>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>